"use strict";

Object.defineProperty(exports, "__esModule", {
	value: true
});

var _keys = require("babel-runtime/core-js/object/keys");

var _keys2 = _interopRequireDefault(_keys);

function _interopRequireDefault(obj) { return obj && obj.__esModule ? obj : { default: obj }; }

// tags and aliases
var PARTS = {
	eyes: ["¬", "｀", "´", "⋋", "⋌", "•", "︶", "-", "ಠ", "◣", "◢", ">", "<", "ﾟ", "⊙", "▽", "꒪", "⇀", "↼", "◯", "￣", "ᗒ", "ᗕ", "˘", "＾", "^", "❛", "┳", "T", "╥", "ಥ", "⁰", "◞", "ò", "ó", "•", "■", "◓", "◔", "✖", "ꏿ", "⁰"],
	mouths: ["д", "■", "ㅂ", "Д", "ᗜ", "ꇴ", "o", "▽", "▿", "▃", "ロ", "口", "∀", "Δ", "ｖ", "‿", "⌣", "▿", "▾", "。", "ᴗ", "ʚ", "∇", "﹃", "ڡ", ".", "_", "﹏", "⌓", "з", "3", "³", "⌒"],
	arms: ["ᕦ", "ᕤ", "ᕙ", "ᕗ", "ᕕ", "┗", "┛", "┏", "┓", "」", "╰", "╯", "ƪ", "ʃ", "ノ", "ヽ", "〈", "ԅ", "ヘ", "づ", "ゝ", "ง", "ヘ", "٩", "۶", "ヾ", "┌", "┘"],
	hands: ["凸", "╭∩╮", "┌∩┐", "t", "o"]
};
var TAGS = {
	fuck: {
		alias: ["日", "干", "操", "艹", "草", "中指"],
		list: ["凸(¬‿¬)", "凸(｀⌒´メ)凸", "凸(｀0´)凸", "凸( •̀_•́ )凸", "╭∩╮(⋋‿⋌)ᕗ", "╭∩╮（︶︿︶）╭∩╮", "╭∩╮(-_-)╭∩╮", "┌∩┐(ಠ_ಠ)┌∩┐", "┌∩┐(◣_◢)┌∩┐", "t( -_- t )", "t(- n -)t"]
	},
	angry: {
		alias: ["mad", "怒"],
		list: ["⋋_⋌", "(⋋▂⋌)", "（＞д＜）", "(>_<)", "(ಠ ∩ಠ)", "<(｀^´)>", "(｀Д´)", "(; ･`д･´)", "(/ﾟДﾟ)/", "o(｀□´)○", "(¬д¬。)", "(°ㅂ° ╬)", "ᕦ(ò_óˇ)ᕤ", "ᕙ(⇀‸↼‶)ᕗ", "┗(｀O´)┛"]
	},
	surprised: {
		alias: ["惊", "惊讶"],
		list: ["(◔ д◔)", "（▽д▽）", "(∥￣■￣∥)", "╰(°ㅂ°)╯", "(」ﾟДﾟ」", "(⊙ᗜ⊙)", "(⊙ꇴ⊙)", "（°o°；）", "(;ﾟдﾟ)", "(;´д｀)", "(ﾉﾟ▽ﾟ)ﾉ", "(๑꒪▿꒪)*", "(oﾟ▽ﾟ)o"]
	},
	shocked: {
		alias: ["astonished", "petrified", "石化", "震惊"],
		list: ["（▽д▽）", "ಠ▃ಠ", "(」ﾟДﾟ」", "(゜ロ゜)", "Σ(･口･)", "(◯Δ◯∥)", "ΣΣ(ﾟДﾟ;)", "(°ㅂ°╬)", "(」゜ロ゜)」", "ヾ(*ﾟ∀ﾟ*)", "ల(｀°Δ°)", "( ﾟдﾟ)", "(╬ ꒪Д꒪)ノ", "(||ﾟДﾟ)", "(ﾟДﾟ||)"]
	},
	scorn: {
		alias: ["轻蔑", "蔑视"],
		list: ["(¬､¬)", "(¬▂¬)"]
	},
	happy: {
		alias: ["喜", "开心"],
		list: ["（＾ｖ＾）", "(＾▽＾)", "｡^‿^｡", "(ᗒᗨᗕ)", "ƪ(˘⌣˘)ʃ", "〈( ^.^)ノ", "(ノ^_^)ノ", "(ノ^o^)ノ", "ヾ(⌐■_■)ノ♪", "(~‾⌣‾)~", "(~‾▿‾)~", "(~˘▾˘)~", "~(‾⌣‾~)", "~(‾▿‾~)", "~(˘▾˘~)", "┗(＾∀＾)┛", "ヽ(^。^)丿", "╰(°ㅂ°)╯", "ヽ(^◇^*)/", "ヽ(´∇｀)ﾉ", "୧(˃◡ु˂)୨", "٩(๑❛ᴗ❛๑)۶", "٩(๑❛ʚ❛๑)۶", "へ(゜∇、°)へ", "(ﾉ^_^)ﾉ", "(> ^_^ )>", "(っ´∀｀)っ", "(っ´▽｀)っ", "(o‿∩)"]
	},
	cute: {
		alias: ["可爱", "lovely", "lovable"],
		list: ["｡^‿^｡", "(▰∀◕)ﾉ", "(´﹃｀)", "(≖ᴗ≖✿)", "٩(^ᴗ^)۶", "(*´ڡ`●)", "ԅ(´ڡ`ԅ)"]
	},
	confused: {
		alias: ["疑惑"],
		list: ["●.◉", "◔_◔", "ఠ_ఠ", "ಠ_ರೃ", "⊙_◎"]
	},
	sweat: {
		alias: ["汗"],
		list: ["(￣ー￣；", "(；ﾟДﾟ)", "(;^_^A", "(ﾟДﾟ;)", "(;ﾟдﾟ)", "(´ε｀；)", "(;￣ー￣川", "(;ﾟдﾟ)", "(;´д｀)"]
	},
	thumb: {
		alias: ["大拇指", "赞"],
		list: ["(＾＾)ｂ", "(^^)ｂ", "d(-_^)", "d(⌒ー⌒)", "(￣ー￣)ｂ", "(b~_^)b", "(￣ε￣〃)ｂ", "d(･∀･○)", "d(>_< )", "( ﾟДﾟ)b", "(o^-')b", "(*￣▽￣)d", "s( ^ ‿ ^)-b"]
	},
	sad: {
		alias: ["cry", "悲伤", "哭", "哭脸", "哭泣"],
		list: ["(┳Д┳)", "T_T", "╥﹏╥", "(ಥ﹏ಥ)", "(☍﹏⁰)｡", "(T⌓T)", "(༎ຶ⌑༎ຶ)", "(╥_╥)", "ಠ╭╮ಠ"]
	},
	shrug: {
		alias: ["耸肩", "whatever"],
		list: ["┐(´д｀)┌", "┐(´～｀)┌", "┐(´ー｀)┌", "╮(╯_╰)╭", "╮(╯∀╰)╭", "┐(´д`)┌", "┐(´∀｀)┌", "¯\\_(ツ)_/¯", "¯\\(°_o)/¯", "t(ツ)_/¯", "\\_(⌣̯̀⌣́)_/¯"]
	},
	depressed: {
		alias: ["沮丧", "放弃"],
		list: ["(_  _|||)", "（◞‸◟）", "(ﾉ´ｰ`)ﾉ", "(ﾉ_ _)ﾉ", "(ノ#-_-)ノ", "t(-_-t)", "(ﾉ￣д￣)ﾉ", "ヘ(_ _ヘ)", "t(-.-t)"]
	},
	kiss: {
		alias: ["吻", "亲"],
		list: ["(*￣з￣)", "（￣ε￣＠）", "|°з°|", "（*＾3＾）", "(´ε｀*)", "(づ￣ ³￣)づ", "o┤*｀3´*├o", "(〃ﾟ3ﾟ〃)", "(*´･з･)", "ヾ(´ε｀*)ゝ"]
	},
	smile: {
		alias: ["微笑"],
		list: ["(¬‿¬)", "｡^‿^｡"]
	},
	fight: {
		alias: ["打架"],
		list: ["ᕦ(ò_óˇ)ᕤ", "ᕙ(⇀‸↼‶)ᕗ", "(ง’̀-‘́)ง", "(ง •̀_•́)ง", "(งಠ_ಠ)ง", "(ง ͠° ͟ʖ ͡°)ง", "Q(｀⌒´Q)", "(ง •̀ゝ•́)ง", "(*ﾟ∀ﾟ)つ＝lニニフ", "ᕦ[ •́ ﹏ •̀ ]⊃¤=[]::::::::>", "(ง ͠ ᵒ̌ Дᵒ̌)¤=[]:::::>"]
	},
	friend: {
		alias: ["朋友"],
		list: ["ヘ( ^o^)ノ＼(^_^ )", "(*･∀･)／＼(･∀･*)", "♪(((#^-^)八(^_^*)))♪", "└(^o^ )Ｘ( ^o^)┘", "٩( ´◡` )( ´◡` )۶"]
	},
	cool: {
		alias: ["酷"],
		list: ["(▀̿Ĺ̯▀̿̿)", "(⌐■_■)"]
	},
	dumb: {
		alias: ["呆"],
		list: ["ಠ_ಠ", "(º﹃º)", "(*´﹃`)", "(¯﹃¯*)", "（’┓`*）", "(￣￢￣*)", "(´┓`*)", "ԅ(´ڡ`ԅ)"]
	},
	embarrassed: {
		alias: ["囧"],
		list: ["ಠ_ಠ", "(o´д｀)o", "（ﾉ´д｀）", "＼(´◓Д◔`)／", "ﾍ(ﾟ∇ﾟﾍ)", "┌(ﾟдﾟ)┘", "┌|*ﾟ｡ﾟ|┘", "(ﾟ×ﾟlll)", "( •́ ✖ •̀)", "( ´△｀)", "(꒪∆꒪;)", "=͟͟͞͞", "(๑°⌓°๑)"]
	},
	sorry: {
		alias: ["抱歉", "对不起", "鞠躬", "bowing"],
		list: ["m(._.)m", "o(_ _)o", "＿|￣|○)) ((○|￣|＿", "＿|￣|●)) ((●|￣|＿", "＿|￣|●", "●|￣|＿", "＿|￣|○", "○|￣|＿", "_/＼○_", "_/＼●_"]
	},
	dead: {
		alias: ["死"],
		list: ["(✖╭╮✖)", "(×_×)", "╭( ✖_✖ )╮", "(✖﹏✖)", "( ✖ ︿ ✖ )", ""]
	},
	evil: {
		alias: ["邪恶"],
		list: ["ψ(｀∇´)ψ", "Ψ( ●｀▽´● )Ψ", "ψ（｀Д´）ψ", "(屮｀∀´)屮", "Ψ(￣∀￣)Ψ", "Ψ(｀▽´)Ψ", "^(#｀∀´)_Ψ", "(｀∀´)Ψ", "ψ`ー´)ﾉ", "ԅ(≖‿≖ԅ)"]
	},
	nervous: {
		alias: ["紧张"],
		list: ["(☍﹏⁰)", "(¤﹏¤)", "⊙﹏⊙", "●﹏●", "ヾ(｡ꏿ﹏ꏿ)ﾉﾞ", "⁀⊙﹏☉⁀", "(-﹏-。)", "(◍•﹏•)", "(‘﹏*๑)", "(๑•﹏•)", "(ó﹏ò｡)", "(｡ŏ﹏ŏ)", "ᗜੂͦ﹏ᗜੂͦ", "(´-﹏-`；)", "(.`･﹏･´.)", "⊙﹏⊙", "ヾ(｡﹏｡)ﾉﾞ", "╰[⁰﹏⁰]╯"]
	},
	roger: {
		alias: ["遵命"],
		list: ["(｀-´)>", "(-ω-ゞ", "|`Д´)＞", "(*゜－＾)ゞ"]
	},
	run: {
		alias: ["跑"],
		list: ["┗(＾0＾)┓", "┏┃*･д┃┛", "┌( ಠ‿ಠ)┘", "ᕕ( ಠ‿ಠ)ᕗ", "ᕕ( ◔3◔)ᕗ", "┗(^o^　)┓三", "┏( ゜)ਊ゜)┛"]
	},
	wtf: {
		alias: ["什么鬼"],
		list: ["(‿ˠ‿)", "(‿ꜟ‿)", "˓˓(‿◟̩ ͜ )˒˒", "(‿|‿)", "(‿!‿)", "(‿!‿) ԅ(´ڡ`ԅ)", "(‿!‿) ԅ(≖‿≖ԅ)", "╰U╯", "( ◜◡＾)っ✂╰⋃╯", "( ◜◡＾)っ╰⋃╯", "(~° ͜ʖ͡°)~ ( . ( . )", "└⋃┘", "╰⋃╯"]
	}
};
var db = {
	"(｀Д´)": ["怒", "angry"],
	"（＾ｖ＾）": ["开心", "happy"],
	"(＾▽＾)": ["开心", "happy"],
	"｡^‿^｡": ["开心", "可爱", "happy", "lovely"],
	"(¬､¬)": ["蔑视"],
	"(¬▂¬)": ["蔑视"],
	"(◔ д◔)": ["惊讶", "surprised"],
	"（▽д▽）": ["惊讶", "石化", "surprised", "petrified"],
	"(*￣з￣)": ["吻", "kiss"],
	"（￣ε￣＠）": ["吻", "kiss"],
	"(_  _|||)": ["沮丧", "depressed"],
	"╭∩╮(⋋‿⋌)ᕗ": ["中指", "fuck"],
	"t( -_- t )": ["中指", "fuck"],
	"凸(¬‿¬)": ["中指", "fuck"],
	"╭∩╮（︶︿︶）╭∩╮": ["中指", "fuck"],
	"凸(｀⌒´メ)凸": ["中指", "fuck"],
	"(∥￣■￣∥)": ["沮丧", "惊讶", "depressed", "surprised"]
};

var tagMap = {};

(0, _keys2.default)(db).forEach(function (emoji) {
	db[emoji].forEach(function (tag) {
		var arr = tagMap[tag];

		if (!arr) {
			arr = [];
			tagMap[tag] = arr;
		}

		arr.push(emoji);
	});
});

exports.default = {
	tagMap: tagMap
};
module.exports = exports["default"];